To proceed further we need a test `tf` that's repeatable. This TF has been tried with `.12` and `.13` - I basically have to run apply 2-3 times before it actually takes. 

Here is what's been put together on our side - feel free to take it and run with it

```terraform
# Required for Terraform 0.13 and up (https://www.terraform.io/upgrade-guides/0-13.html)
terraform {
  required_providers {
    artifactory = {
      source  = "registry.terraform.io/jfrog/artifactory"
      version = "2.2.5"
    }
  }
}
provider "artifactory" {
  url = "https://christianb.jfrog.tech/artifactory"
  username = "admin"
  password = "Password1"
}
resource "artifactory_group" "test-group" {
  name             = "terraform"
  description      = "test group"
  admin_privileges = false
}
//# Create a new Artifactory group called terraform
resource "artifactory_user" "test-user" {
  name     = "terraform"
  email    = "test-user@artifactory-terraform.com"
  groups   = ["terraform", "readers"]
  password = "Password1"
}

//# Create a new Artifactory user called terraform

resource "artifactory_access_token" "existing_user" {
  username          = "terraform"
  end_date_relative = "5m"
}
resource "artifactory_access_token" "new_user" {
  username          = "terraform"
  end_date_relative = "1h"
  groups = [
    "readers",
    "terraform"
  ]
}
resource "artifactory_access_token" "no_expiry" {
  username          = "terraform"
  end_date_relative = "0s"
}
resource "artifactory_access_token" "refreshable" {
  username          = "terraform"
  end_date_relative = "1m"
  refreshable = true
  groups = [
    "readers",
    "terraform"
  ]
}
resource "artifactory_access_token" "audience" {
  username          = "terraform"
  end_date_relative = "1m"
  audience = "jfrt@*"
  refreshable = true
}
resource "artifactory_access_token" "fixeddate" {
  username = "terraform"
  end_date = "2021-01-01T01:02:03Z"
  groups = [
    "readers",
    "terraform"
  ]
}
resource "time_rotating" "now_plus_1_hours" {
  rotation_hours = "1"
}

```
I run 
```bash
go build
go install # install isn't actually installing anything; infact, it's deleting the binary. I had to manually put it where it should be:

ls ~/.terraform.d/plugins/registry.terraform.io/jfrog/artifactory/2.2.5/darwin_amd64/terraform-provider-artifactory
/Users/christianb/.terraform.d/plugins/registry.terraform.io/jfrog/artifactory/2.2.5/darwin_amd64/terraform-provider-artifactory
```


When I run the above terraform script against a kube cluster install of jfrog artifactory in gcp I get:


```bash
christianb@christianb-mac terraform-provider-artifactory % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_access_token.audience will be created
  + resource "artifactory_access_token" "audience" {
      + access_token      = (sensitive value)
      + audience          = "jfrt@*"
      + end_date          = (known after apply)
      + end_date_relative = "1m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = true
      + username          = "terraform"
    }

  # artifactory_access_token.existing_user will be created
  + resource "artifactory_access_token" "existing_user" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "5m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_access_token.fixeddate will be created
  + resource "artifactory_access_token" "fixeddate" {
      + access_token  = (sensitive value)
      + end_date      = "2021-01-01T01:02:03Z"
      + groups        = [
          + "readers",
          + "terraform",
        ]
      + id            = (known after apply)
      + refresh_token = (sensitive value)
      + refreshable   = false
      + username      = "terraform"
    }

  # artifactory_access_token.new_user will be created
  + resource "artifactory_access_token" "new_user" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "1h"
      + groups            = [
          + "readers",
          + "terraform",
        ]
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_access_token.no_expiry will be created
  + resource "artifactory_access_token" "no_expiry" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "0s"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_access_token.refreshable will be created
  + resource "artifactory_access_token" "refreshable" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "1m"
      + groups            = [
          + "readers",
          + "terraform",
        ]
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = true
      + username          = "terraform"
    }

  # artifactory_group.test-group will be created
  + resource "artifactory_group" "test-group" {
      + admin_privileges = false
      + auto_join        = (known after apply)
      + description      = "test group"
      + id               = (known after apply)
      + name             = "terraform"
      + realm            = (known after apply)
    }

  # artifactory_user.test-user will be created
  + resource "artifactory_user" "test-user" {
      + admin                      = (known after apply)
      + disable_ui_access          = (known after apply)
      + email                      = "test-user@artifactory-terraform.com"
      + groups                     = [
          + "readers",
          + "terraform",
        ]
      + id                         = (known after apply)
      + internal_password_disabled = (known after apply)
      + name                       = "terraform"
      + password                   = (sensitive value)
      + profile_updatable          = (known after apply)
    }

  # time_rotating.now_plus_1_hours will be created
  + resource "time_rotating" "now_plus_1_hours" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_hours   = 1
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

time_rotating.now_plus_1_hours: Creating...
time_rotating.now_plus_1_hours: Creation complete after 0s [id=2020-11-18T18:28:35Z]
artifactory_access_token.refreshable: Creating...
artifactory_access_token.no_expiry: Creating...
artifactory_access_token.new_user: Creating...
artifactory_access_token.existing_user: Creating...
artifactory_access_token.fixeddate: Creating...
artifactory_access_token.audience: Creating...
artifactory_user.test-user: Creating...
artifactory_group.test-group: Creating...
artifactory_group.test-group: Creation complete after 1s [id=terraform]
artifactory_access_token.fixeddate: Creation complete after 1s [id=2840873941]
artifactory_access_token.new_user: Creation complete after 1s [id=3997111315]
artifactory_access_token.refreshable: Creation complete after 1s [id=3573456991]

Error: PUT https://christianb.jfrog.tech/artifactory/api/security/users/terraform: 400 [{Status:400 Message:Could not create user}]

  on test.tf line 21, in resource "artifactory_user" "test-user":
  21: resource "artifactory_user" "test-user" {



Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 30, in resource "artifactory_access_token" "existing_user":
  30: resource "artifactory_access_token" "existing_user" {



Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 42, in resource "artifactory_access_token" "no_expiry":
  42: resource "artifactory_access_token" "no_expiry" {



Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 55, in resource "artifactory_access_token" "audience":
  55: resource "artifactory_access_token" "audience" {


christianb@christianb-mac terraform-provider-artifactory % terraform apply
time_rotating.now_plus_1_hours: Refreshing state... [id=2020-11-18T18:28:35Z]
artifactory_group.test-group: Refreshing state... [id=terraform]
artifactory_access_token.new_user: Refreshing state... [id=3997111315]
artifactory_access_token.fixeddate: Refreshing state... [id=2840873941]
artifactory_access_token.refreshable: Refreshing state... [id=3573456991]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_access_token.audience will be created
  + resource "artifactory_access_token" "audience" {
      + access_token      = (sensitive value)
      + audience          = "jfrt@*"
      + end_date          = (known after apply)
      + end_date_relative = "1m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = true
      + username          = "terraform"
    }

  # artifactory_access_token.existing_user will be created
  + resource "artifactory_access_token" "existing_user" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "5m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_access_token.no_expiry will be created
  + resource "artifactory_access_token" "no_expiry" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "0s"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_user.test-user will be created
  + resource "artifactory_user" "test-user" {
      + admin                      = (known after apply)
      + disable_ui_access          = (known after apply)
      + email                      = "test-user@artifactory-terraform.com"
      + groups                     = [
          + "readers",
          + "terraform",
        ]
      + id                         = (known after apply)
      + internal_password_disabled = (known after apply)
      + name                       = "terraform"
      + password                   = (sensitive value)
      + profile_updatable          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_access_token.audience: Creating...
artifactory_access_token.existing_user: Creating...
artifactory_user.test-user: Creating...
artifactory_access_token.no_expiry: Creating...
artifactory_user.test-user: Creation complete after 1s [id=terraform]

Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 30, in resource "artifactory_access_token" "existing_user":
  30: resource "artifactory_access_token" "existing_user" {



Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 42, in resource "artifactory_access_token" "no_expiry":
  42: resource "artifactory_access_token" "no_expiry" {



Error: you must specify at least 1 group when creating a token for a non-existant user - terraform, or correct the username

  on test.tf line 55, in resource "artifactory_access_token" "audience":
  55: resource "artifactory_access_token" "audience" {


christianb@christianb-mac terraform-provider-artifactory % terraform apply
time_rotating.now_plus_1_hours: Refreshing state... [id=2020-11-18T18:28:35Z]
artifactory_access_token.new_user: Refreshing state... [id=3997111315]
artifactory_access_token.refreshable: Refreshing state... [id=3573456991]
artifactory_user.test-user: Refreshing state... [id=terraform]
artifactory_access_token.fixeddate: Refreshing state... [id=2840873941]
artifactory_group.test-group: Refreshing state... [id=terraform]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_access_token.audience will be created
  + resource "artifactory_access_token" "audience" {
      + access_token      = (sensitive value)
      + audience          = "jfrt@*"
      + end_date          = (known after apply)
      + end_date_relative = "1m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = true
      + username          = "terraform"
    }

  # artifactory_access_token.existing_user will be created
  + resource "artifactory_access_token" "existing_user" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "5m"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

  # artifactory_access_token.no_expiry will be created
  + resource "artifactory_access_token" "no_expiry" {
      + access_token      = (sensitive value)
      + end_date          = (known after apply)
      + end_date_relative = "0s"
      + id                = (known after apply)
      + refresh_token     = (sensitive value)
      + refreshable       = false
      + username          = "terraform"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_access_token.audience: Creating...
artifactory_access_token.no_expiry: Creating...
artifactory_access_token.existing_user: Creating...
artifactory_access_token.audience: Creation complete after 0s [id=917914487]
artifactory_access_token.existing_user: Creation complete after 0s [id=3728992805]
artifactory_access_token.no_expiry: Creation complete after 0s [id=239402867]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
christianb@christianb-mac terraform-provider-artifactory % git branch
* (HEAD detached at jbarker/feat/access-token)
  master
christianb@christianb-mac terraform-provider-artifactory % git remote -v
jbarker git@github.com:colesgroup/terraform-provider-artifactory.git (fetch)
jbarker git@github.com:colesgroup/terraform-provider-artifactory.git (push)
origin  git@github.com:jfrog/terraform-provider-artifactory.git (fetch)
origin  git@github.com:jfrog/terraform-provider-artifactory.git (push)
christianb@christianb-mac terraform-provider-artifactory % 

```

